[NoCoverage] BlockStatement
src/application/services/ProductoService.js:4:35
 const IProductoService = require('../../domain/ports/IProductoService');
 
 class ProductoService extends IProductoService {
-  constructor(productoRepository) {
-    super();
-    this.productoRepository = productoRepository;
-  }
+  constructor(productoRepository) {}
 
   async obtenerTodos() {

[NoCoverage] BlockStatement
src/application/services/ProductoService.js:9:24
     this.productoRepository = productoRepository;
   }
 
-  async obtenerTodos() {
-    return await this.productoRepository.getAll();
-  }
+  async obtenerTodos() {}
 
   async obtenerPorId(id) {

[NoCoverage] BlockStatement
src/application/services/ProductoService.js:13:26
     return await this.productoRepository.getAll();
   }
 
-  async obtenerPorId(id) {
-    const producto = await this.productoRepository.getById(id);
-    if (!producto) throw new Error('Producto no encontrado');
-    return producto;
-  }
+  async obtenerPorId(id) {}
 
   async crear(datos) {

[NoCoverage] BooleanLiteral
src/application/services/ProductoService.js:15:9
 
   async obtenerPorId(id) {
     const producto = await this.productoRepository.getById(id);
-    if (!producto) throw new Error('Producto no encontrado');
+    if (producto) throw new Error('Producto no encontrado');
     return producto;
   }

[NoCoverage] ConditionalExpression
src/application/services/ProductoService.js:15:9
 
   async obtenerPorId(id) {
     const producto = await this.productoRepository.getById(id);
-    if (!producto) throw new Error('Producto no encontrado');
+    if (false) throw new Error('Producto no encontrado');
     return producto;
   }

[NoCoverage] BlockStatement
src/application/services/ProductoService.js:19:22
     return producto;
   }
 
-  async crear(datos) {
-    return await this.productoRepository.create(datos);
-  }
+  async crear(datos) {}
 
   async actualizar(id, datos) {

[NoCoverage] BlockStatement
src/application/services/ProductoService.js:23:31
     return await this.productoRepository.create(datos);
   }
 
-  async actualizar(id, datos) {
-    return await this.productoRepository.update(id, datos);
-  }
+  async actualizar(id, datos) {}
 
   async eliminar(id) {

[NoCoverage] BlockStatement
src/application/services/ProductoService.js:27:22
     return await this.productoRepository.update(id, datos);
   }
 
-  async eliminar(id) {
-    return await this.productoRepository.delete(id);
-  }
+  async eliminar(id) {}
 }
 
