[Killed] BlockStatement
src/application/services/ReservacionService.js:5:58
 const Reservacion = require('../../domain/entities/Reservacion');
 
 class ReservacionService extends IReservacionService {
-  constructor(reservacionRepository, productoRepository) {
-    super();
-    this.reservacionRepository = reservacionRepository;
-    this.productoRepository = productoRepository;
-  }
+  constructor(reservacionRepository, productoRepository) {}
 
   async obtenerTodas() {
killedBy: ReservacionService CP21 - crear reservacion debe llamar al repositorio
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/application/services/ReservacionService.js:11:24
     this.productoRepository = productoRepository;
   }
 
-  async obtenerTodas() {
-    return await this.reservacionRepository.getAllConProductos();
-  }
+  async obtenerTodas() {}
 
   async crear(datos) {
killedBy: ReservacionService CP23 - obtenerTodas debe retornar lista de reservaciones
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1, "nombre_cliente": "Juan Perez"}]
Received: undefined

[Killed] BlockStatement
src/application/services/ReservacionService.js:15:22
     return await this.reservacionRepository.getAllConProductos();
   }
 
-  async crear(datos) {
-    const reservacion = new Reservacion(datos);
-    reservacion.validar();
-
-    const nuevaReservacion = await this.reservacionRepository.create(reservacion);
-
-    if (datos.producto_adicional_id && datos.cantidad_producto) {
-      const producto = await this.productoRepository.getById(datos.producto_adicional_id);
-      if (producto) {
-        const nuevaCantidad = producto.cantidad - datos.cantidad_producto;
-        if (nuevaCantidad >= 0) {
-          await this.productoRepository.update(datos.producto_adicional_id, { cantidad: nuevaCantidad });
-        }
-      }
-    }
-
-    return nuevaReservacion;
-  }
+  async crear(datos) {}
 
   async actualizarEstado(id, estado) {
killedBy: ReservacionService CP21 - crear reservacion debe llamar al repositorio
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "juan@gmail.com", "especie": "perro", "fecha_solicitada": "2024-06-01", "hora_solicitada": "10:00", "id": 1, "motivo_consulta": "Consulta general", "nombre_cliente": "Juan Perez", "nombre_mascota": "Firulais", "telefono": "999888777", "tipo_cita": "consulta"}
Received: undefined

[Killed] BlockStatement
src/application/services/ReservacionService.js:21:65
 
     const nuevaReservacion = await this.reservacionRepository.create(reservacion);
 
-    if (datos.producto_adicional_id && datos.cantidad_producto) {
-      const producto = await this.productoRepository.getById(datos.producto_adicional_id);
-      if (producto) {
-        const nuevaCantidad = producto.cantidad - datos.cantidad_producto;
-        if (nuevaCantidad >= 0) {
-          await this.productoRepository.update(datos.producto_adicional_id, { cantidad: nuevaCantidad });
-        }
-      }
-    }
+    if (datos.producto_adicional_id && datos.cantidad_producto) {}
 
     return nuevaReservacion;
killedBy: ReservacionService CP - crear reservacion con producto adicional debe actualizar stock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/application/services/ReservacionService.js:21:9
 
     const nuevaReservacion = await this.reservacionRepository.create(reservacion);
 
-    if (datos.producto_adicional_id && datos.cantidad_producto) {
+    if (false) {
       const producto = await this.productoRepository.getById(datos.producto_adicional_id);
       if (producto) {
killedBy: ReservacionService CP - crear reservacion con producto adicional debe actualizar stock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/application/services/ReservacionService.js:23:11
 
     if (datos.producto_adicional_id && datos.cantidad_producto) {
       const producto = await this.productoRepository.getById(datos.producto_adicional_id);
-      if (producto) {
+      if (false) {
         const nuevaCantidad = producto.cantidad - datos.cantidad_producto;
         if (nuevaCantidad >= 0) {
killedBy: ReservacionService CP - crear reservacion con producto adicional debe actualizar stock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/application/services/ReservacionService.js:23:21
 
     if (datos.producto_adicional_id && datos.cantidad_producto) {
       const producto = await this.productoRepository.getById(datos.producto_adicional_id);
-      if (producto) {
-        const nuevaCantidad = producto.cantidad - datos.cantidad_producto;
-        if (nuevaCantidad >= 0) {
-          await this.productoRepository.update(datos.producto_adicional_id, { cantidad: nuevaCantidad });
-        }
-      }
+      if (producto) {}
     }
 
killedBy: ReservacionService CP - crear reservacion con producto adicional debe actualizar stock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ArithmeticOperator
src/application/services/ReservacionService.js:24:31
     if (datos.producto_adicional_id && datos.cantidad_producto) {
       const producto = await this.productoRepository.getById(datos.producto_adicional_id);
       if (producto) {
-        const nuevaCantidad = producto.cantidad - datos.cantidad_producto;
+        const nuevaCantidad = producto.cantidad + datos.cantidad_producto;
         if (nuevaCantidad >= 0) {
           await this.productoRepository.update(datos.producto_adicional_id, { cantidad: nuevaCantidad });

[Killed] ConditionalExpression
src/application/services/ReservacionService.js:25:13
       const producto = await this.productoRepository.getById(datos.producto_adicional_id);
       if (producto) {
         const nuevaCantidad = producto.cantidad - datos.cantidad_producto;
-        if (nuevaCantidad >= 0) {
+        if (false) {
           await this.productoRepository.update(datos.producto_adicional_id, { cantidad: nuevaCantidad });
         }
killedBy: ReservacionService CP - crear reservacion con producto adicional debe actualizar stock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] EqualityOperator
src/application/services/ReservacionService.js:25:13
       const producto = await this.productoRepository.getById(datos.producto_adicional_id);
       if (producto) {
         const nuevaCantidad = producto.cantidad - datos.cantidad_producto;
-        if (nuevaCantidad >= 0) {
+        if (nuevaCantidad < 0) {
           await this.productoRepository.update(datos.producto_adicional_id, { cantidad: nuevaCantidad });
         }
killedBy: ReservacionService CP - crear reservacion con producto adicional debe actualizar stock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/application/services/ReservacionService.js:34:38
     return nuevaReservacion;
   }
 
-  async actualizarEstado(id, estado) {
-    const reservacion = new Reservacion({});
-    reservacion.validarEstado(estado);
-    return await this.reservacionRepository.update(id, { estado });
-  }
+  async actualizarEstado(id, estado) {}
 
   async eliminar(id) {
killedBy: ReservacionService CP22 - actualizarEstado con estado invalido debe lanzar error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[NoCoverage] ObjectLiteral
src/application/services/ReservacionService.js:37:56
   async actualizarEstado(id, estado) {
     const reservacion = new Reservacion({});
     reservacion.validarEstado(estado);
-    return await this.reservacionRepository.update(id, { estado });
+    return await this.reservacionRepository.update(id, {});
   }
 

[Killed] BlockStatement
src/application/services/ReservacionService.js:40:22
     return await this.reservacionRepository.update(id, { estado });
   }
 
-  async eliminar(id) {
-    const reservacion = await this.reservacionRepository.getById(id);
-    if (!reservacion) throw new Error('Reservacion no encontrada');
-    await this.reservacionRepository.delete(id);
-  }
+  async eliminar(id) {}
 }
 
killedBy: ReservacionService CP24 - eliminar reservacion debe llamar al repositorio
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/application/services/ReservacionService.js:42:9
 
   async eliminar(id) {
     const reservacion = await this.reservacionRepository.getById(id);
-    if (!reservacion) throw new Error('Reservacion no encontrada');
+    if (false) throw new Error('Reservacion no encontrada');
     await this.reservacionRepository.delete(id);
   }
killedBy: ReservacionService CP - eliminar reservacion inexistente debe lanzar error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
src/application/services/ReservacionService.js:42:9
 
   async eliminar(id) {
     const reservacion = await this.reservacionRepository.getById(id);
-    if (!reservacion) throw new Error('Reservacion no encontrada');
+    if (reservacion) throw new Error('Reservacion no encontrada');
     await this.reservacionRepository.delete(id);
   }
killedBy: ReservacionService CP24 - eliminar reservacion debe llamar al repositorio
statusReason: Error: Reservacion no encontrada
