[Killed] BlockStatement
src/application/services/MascotaService.js:5:71
 const Mascota = require('../../domain/entities/Mascota');
 
 class MascotaService extends IMascotaService {
-  constructor(mascotaRepository, dueñoRepository, productoRepository) {
-    super();
-    this.mascotaRepository = mascotaRepository;
-    this.dueñoRepository = dueñoRepository;
-    this.productoRepository = productoRepository;
-  }
+  constructor(mascotaRepository, dueñoRepository, productoRepository) {}
 
   async obtenerTodas() {
killedBy: MascotaService CP15 - obtenerTodas debe retornar lista de mascotas
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/application/services/MascotaService.js:12:24
     this.productoRepository = productoRepository;
   }
 
-  async obtenerTodas() {
-    return await this.mascotaRepository.getMascotasConDueños();
-  }
+  async obtenerTodas() {}
 
   async obtenerPorId(id) {
killedBy: MascotaService CP15 - obtenerTodas debe retornar lista de mascotas
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1, "nombre": "Firulais"}]
Received: undefined

[Killed] BlockStatement
src/application/services/MascotaService.js:16:26
     return await this.mascotaRepository.getMascotasConDueños();
   }
 
-  async obtenerPorId(id) {
-    const mascota = await this.mascotaRepository.getMascotaConDueño(id);
-    if (!mascota) throw new Error('Mascota no encontrada');
-    return mascota;
-  }
+  async obtenerPorId(id) {}
 
   async crear(datos) {
killedBy: MascotaService CP16 - obtenerPorId con id inexistente debe lanzar error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/application/services/MascotaService.js:18:9
 
   async obtenerPorId(id) {
     const mascota = await this.mascotaRepository.getMascotaConDueño(id);
-    if (!mascota) throw new Error('Mascota no encontrada');
+    if (true) throw new Error('Mascota no encontrada');
     return mascota;
   }
killedBy: MascotaService CP17 - obtenerPorId con id existente debe retornar la mascota
statusReason: Error: Mascota no encontrada

[Killed] ConditionalExpression
src/application/services/MascotaService.js:18:9
 
   async obtenerPorId(id) {
     const mascota = await this.mascotaRepository.getMascotaConDueño(id);
-    if (!mascota) throw new Error('Mascota no encontrada');
+    if (false) throw new Error('Mascota no encontrada');
     return mascota;
   }
killedBy: MascotaService CP16 - obtenerPorId con id inexistente debe lanzar error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/application/services/MascotaService.js:22:22
     return mascota;
   }
 
-  async crear(datos) {
-    const mascota = new Mascota(datos);
-    mascota.validar();
-
-    const nuevoDueño = await this.dueñoRepository.create({
-      nombre_completo: datos.nombre_dueño,
-      telefono: datos.telefono,
-      email: datos.email
-    });
-
-    mascota.id_dueño = nuevoDueño.id;
-    const nuevaMascota = await this.mascotaRepository.create(mascota);
-
-    if (datos.producto_adicional_id && datos.cantidad_producto) {
-      const producto = await this.productoRepository.getById(datos.producto_adicional_id);
-      if (producto) {
-        const nuevaCantidad = producto.cantidad - datos.cantidad_producto;
-        if (nuevaCantidad >= 0) {
-          await this.productoRepository.update(datos.producto_adicional_id, { cantidad: nuevaCantidad });
-        }
-      }
-    }
-
-    return { mascota: nuevaMascota, dueño: nuevoDueño };
-  }
+  async crear(datos) {}
 
   async actualizar(id, datos) {
killedBy: MascotaService CP20 - crear mascota debe llamar al repositorio de dueños
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ObjectLiteral
src/application/services/MascotaService.js:26:58
     const mascota = new Mascota(datos);
     mascota.validar();
 
-    const nuevoDueño = await this.dueñoRepository.create({
-      nombre_completo: datos.nombre_dueño,
-      telefono: datos.telefono,
-      email: datos.email
-    });
+    const nuevoDueño = await this.dueñoRepository.create({});
 
     mascota.id_dueño = nuevoDueño.id;
killedBy: MascotaService CP - crear mascota con datos del dueño correctos
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "juan@gmail.com",
-   "nombre_completo": "Juan Perez",

[Killed] BlockStatement
src/application/services/MascotaService.js:39:33
       const producto = await this.productoRepository.getById(datos.producto_adicional_id);
       if (producto) {
         const nuevaCantidad = producto.cantidad - datos.cantidad_producto;
-        if (nuevaCantidad >= 0) {
-          await this.productoRepository.update(datos.producto_adicional_id, { cantidad: nuevaCantidad });
-        }
+        if (nuevaCantidad >= 0) {}
       }
     }
killedBy: MascotaService CP - crear mascota con producto adicional debe actualizar stock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ObjectLiteral
src/application/services/MascotaService.js:40:77
       if (producto) {
         const nuevaCantidad = producto.cantidad - datos.cantidad_producto;
         if (nuevaCantidad >= 0) {
-          await this.productoRepository.update(datos.producto_adicional_id, { cantidad: nuevaCantidad });
+          await this.productoRepository.update(datos.producto_adicional_id, {});
         }
       }

[Killed] BlockStatement
src/application/services/MascotaService.js:48:31
     return { mascota: nuevaMascota, dueño: nuevoDueño };
   }
 
-  async actualizar(id, datos) {
-    return await this.mascotaRepository.update(id, datos);
-  }
+  async actualizar(id, datos) {}
 
   async eliminar(id) {
killedBy: MascotaService CP18 - actualizar mascota debe llamar al repositorio
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": 1, "nombre": "Firulais actualizado"}
Received: undefined

[Killed] BlockStatement
src/application/services/MascotaService.js:52:22
     return await this.mascotaRepository.update(id, datos);
   }
 
-  async eliminar(id) {
-    const mascota = await this.mascotaRepository.getById(id);
-    if (!mascota) throw new Error('Mascota no encontrada');
-    await this.mascotaRepository.delete(id);
-    return mascota.id_dueño;
-  }
+  async eliminar(id) {}
 }
 
killedBy: MascotaService CP19 - eliminar mascota debe llamar al repositorio
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/application/services/MascotaService.js:54:9
 
   async eliminar(id) {
     const mascota = await this.mascotaRepository.getById(id);
-    if (!mascota) throw new Error('Mascota no encontrada');
+    if (mascota) throw new Error('Mascota no encontrada');
     await this.mascotaRepository.delete(id);
     return mascota.id_dueño;
killedBy: MascotaService CP19 - eliminar mascota debe llamar al repositorio
statusReason: Error: Mascota no encontrada

[Killed] ConditionalExpression
src/application/services/MascotaService.js:54:9
 
   async eliminar(id) {
     const mascota = await this.mascotaRepository.getById(id);
-    if (!mascota) throw new Error('Mascota no encontrada');
+    if (false) throw new Error('Mascota no encontrada');
     await this.mascotaRepository.delete(id);
     return mascota.id_dueño;
killedBy: MascotaService CP - eliminar mascota inexistente debe lanzar error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Mascota no encontrada"
Received message:   "Cannot read properties of null (reading 'id_dueño')"

      140 |       if (stryMutAct_9fa48("28") ? false : stryMutAct_9fa48("27") ? true : stryMutAct_9fa48("26") ? mascota : (stryCov_9fa48("26", "27", "28"), !mascota)) throw new Error(stryMutAct_9fa48("29") ? "" : (stryCov_9fa48("2
