[Killed] BlockStatement
src/domain/entities/Mascota.js:2:112
 class Mascota {
-  constructor({ id, nombre, especie, edad, sexo, motivo, id_dueño, producto_adicional_id, cantidad_producto }) {
-    this.id = id;
-    this.nombre = nombre;
-    this.especie = especie ? especie.toLowerCase() : null;
-    this.edad = edad;
-    this.sexo = sexo;
-    this.motivo = motivo;
-    this.id_dueño = id_dueño;
-    this.producto_adicional_id = producto_adicional_id;
-    this.cantidad_producto = cantidad_producto;
-  }
+  constructor({ id, nombre, especie, edad, sexo, motivo, id_dueño, producto_adicional_id, cantidad_producto }) {}
 
   validar() {
killedBy: MascotaService CP20 - crear mascota debe llamar al repositorio de dueños
statusReason: Error: Faltan campos requeridos: nombre, especie, edad, sexo

[Killed] MethodExpression
src/domain/entities/Mascota.js:5:30
   constructor({ id, nombre, especie, edad, sexo, motivo, id_dueño, producto_adicional_id, cantidad_producto }) {
     this.id = id;
     this.nombre = nombre;
-    this.especie = especie ? especie.toLowerCase() : null;
+    this.especie = especie ? especie.toUpperCase() : null;
     this.edad = edad;
     this.sexo = sexo;
killedBy: Mascota CP01 - crear mascota con datos correctos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "perro"
Received: "PERRO"

[Killed] BlockStatement
src/domain/entities/Mascota.js:14:13
     this.cantidad_producto = cantidad_producto;
   }
 
-  validar() {
-    if (!this.nombre || !this.especie || !this.edad || !this.sexo) {
-      throw new Error('Faltan campos requeridos: nombre, especie, edad, sexo');
-    }
-  }
+  validar() {}
 }
 
killedBy: Mascota CP02 - crear mascota sin nombre debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Faltan campos requeridos"

Received function did not throw

[Killed] LogicalOperator
src/domain/entities/Mascota.js:15:9
   }
 
   validar() {
-    if (!this.nombre || !this.especie || !this.edad || !this.sexo) {
+    if ((!this.nombre || !this.especie || !this.edad) && !this.sexo) {
       throw new Error('Faltan campos requeridos: nombre, especie, edad, sexo');
     }
killedBy: Mascota CP02 - crear mascota sin nombre debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Faltan campos requeridos"

Received function did not throw

[Killed] LogicalOperator
src/domain/entities/Mascota.js:15:9
   }
 
   validar() {
-    if (!this.nombre || !this.especie || !this.edad || !this.sexo) {
+    if (!this.nombre && !this.especie || !this.edad || !this.sexo) {
       throw new Error('Faltan campos requeridos: nombre, especie, edad, sexo');
     }
killedBy: Mascota CP02 - crear mascota sin nombre debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Faltan campos requeridos"

Received function did not throw
