[Killed] BlockStatement
src/domain/entities/Producto.js:2:49
 class Producto {
-  constructor({ id, nombre, precio, cantidad }) {
-    this.id = id;
-    this.nombre = nombre;
-    this.precio = precio;
-    this.cantidad = cantidad;
-  }
+  constructor({ id, nombre, precio, cantidad }) {}
 
   validar() {
killedBy: Producto CP10 - crear producto con datos correctos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Vacuna"
Received: undefined

[Killed] BlockStatement
src/domain/entities/Producto.js:9:13
     this.cantidad = cantidad;
   }
 
-  validar() {
-    if (!this.nombre || !this.precio) {
-      throw new Error('Faltan campos requeridos: nombre, precio');
-    }
-  }
+  validar() {}
 
   reducirStock(cantidad) {
killedBy: Producto CP13 - crear producto sin nombre debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Faltan campos requeridos"

Received function did not throw

[Killed] LogicalOperator
src/domain/entities/Producto.js:10:9
   }
 
   validar() {
-    if (!this.nombre || !this.precio) {
+    if (!this.nombre && !this.precio) {
       throw new Error('Faltan campos requeridos: nombre, precio');
     }
killedBy: Producto CP13 - crear producto sin nombre debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Faltan campos requeridos"

Received function did not throw

[Killed] BooleanLiteral
src/domain/entities/Producto.js:10:25
   }
 
   validar() {
-    if (!this.nombre || !this.precio) {
+    if (!this.nombre || this.precio) {
       throw new Error('Faltan campos requeridos: nombre, precio');
     }
killedBy: Producto CP14 - crear producto sin precio debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Faltan campos requeridos"

Received function did not throw

[Killed] BlockStatement
src/domain/entities/Producto.js:15:26
     }
   }
 
-  reducirStock(cantidad) {
-    if (this.cantidad - cantidad < 0) {
-      throw new Error('Stock insuficiente');
-    }
-    this.cantidad = this.cantidad - cantidad;
-  }
+  reducirStock(cantidad) {}
 }
 
killedBy: Producto CP11 - reducir stock con cantidad valida
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 10

[Killed] ArithmeticOperator
src/domain/entities/Producto.js:16:9
   }
 
   reducirStock(cantidad) {
-    if (this.cantidad - cantidad < 0) {
+    if (this.cantidad + cantidad < 0) {
       throw new Error('Stock insuficiente');
     }
killedBy: Producto CP12 - reducir stock por debajo de cero debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Stock insuficiente"

Received function did not throw

[Killed] ConditionalExpression
src/domain/entities/Producto.js:16:9
   }
 
   reducirStock(cantidad) {
-    if (this.cantidad - cantidad < 0) {
+    if (false) {
       throw new Error('Stock insuficiente');
     }
killedBy: Producto CP12 - reducir stock por debajo de cero debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Stock insuficiente"

Received function did not throw

[Killed] ArithmeticOperator
src/domain/entities/Producto.js:19:21
     if (this.cantidad - cantidad < 0) {
       throw new Error('Stock insuficiente');
     }
-    this.cantidad = this.cantidad - cantidad;
+    this.cantidad = this.cantidad + cantidad;
   }
 }
killedBy: Producto CP11 - reducir stock con cantidad valida
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 13
