[Killed] BlockStatement
src/domain/entities/Reservacion.js:2:194
 class Reservacion {
-  constructor({ id, nombre_cliente, telefono, email, nombre_mascota, especie, motivo_consulta, fecha_solicitada, hora_solicitada, tipo_cita, estado, producto_adicional_id, cantidad_producto }) {
-    this.id = id;
-    this.nombre_cliente = nombre_cliente;
-    this.telefono = telefono;
-    this.email = email;
-    this.nombre_mascota = nombre_mascota;
-    this.especie = especie ? especie.toLowerCase() : null;
-    this.motivo_consulta = motivo_consulta;
-    this.fecha_solicitada = fecha_solicitada;
-    this.hora_solicitada = hora_solicitada;
-    this.tipo_cita = tipo_cita;
-    this.estado = estado || 'pendiente';
-    this.producto_adicional_id = producto_adicional_id;
-    this.cantidad_producto = cantidad_producto;
-  }
+  constructor({ id, nombre_cliente, telefono, email, nombre_mascota, especie, motivo_consulta, fecha_solicitada, hora_solicitada, tipo_cita, estado, producto_adicional_id, cantidad_producto }) {}
 
   validar() {
killedBy: ReservacionService CP21 - crear reservacion debe llamar al repositorio
statusReason: Error: Faltan campos requeridos para la reservacion

[Killed] MethodExpression
src/domain/entities/Reservacion.js:8:30
     this.telefono = telefono;
     this.email = email;
     this.nombre_mascota = nombre_mascota;
-    this.especie = especie ? especie.toLowerCase() : null;
+    this.especie = especie ? especie.toUpperCase() : null;
     this.motivo_consulta = motivo_consulta;
     this.fecha_solicitada = fecha_solicitada;
killedBy: Reservacion CP - especie debe guardarse en minusculas en reservacion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "perro"
Received: "PERRO"

[Killed] ConditionalExpression
src/domain/entities/Reservacion.js:13:19
     this.fecha_solicitada = fecha_solicitada;
     this.hora_solicitada = hora_solicitada;
     this.tipo_cita = tipo_cita;
-    this.estado = estado || 'pendiente';
+    this.estado = false;
     this.producto_adicional_id = producto_adicional_id;
     this.cantidad_producto = cantidad_producto;
killedBy: Reservacion CP07 - estado inicial debe ser pendiente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pendiente"
Received: false

[Killed] ConditionalExpression
src/domain/entities/Reservacion.js:13:19
     this.fecha_solicitada = fecha_solicitada;
     this.hora_solicitada = hora_solicitada;
     this.tipo_cita = tipo_cita;
-    this.estado = estado || 'pendiente';
+    this.estado = true;
     this.producto_adicional_id = producto_adicional_id;
     this.cantidad_producto = cantidad_producto;
killedBy: Reservacion CP07 - estado inicial debe ser pendiente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pendiente"
Received: true

[Killed] BlockStatement
src/domain/entities/Reservacion.js:18:13
     this.cantidad_producto = cantidad_producto;
   }
 
-  validar() {
-    if (!this.nombre_cliente || !this.telefono || !this.email || !this.nombre_mascota ||
-        !this.especie || !this.motivo_consulta || !this.fecha_solicitada ||
-        !this.hora_solicitada || !this.tipo_cita) {
-      throw new Error('Faltan campos requeridos para la reservacion');
-    }
-  }
+  validar() {}
 
   validarEstado(estado) {
killedBy: Reservacion CP06 - crear reservacion sin nombre cliente debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Faltan campos requeridos"

Received function did not throw

[Killed] BooleanLiteral
src/domain/entities/Reservacion.js:19:9
   }
 
   validar() {
-    if (!this.nombre_cliente || !this.telefono || !this.email || !this.nombre_mascota ||
+    if (this.nombre_cliente || !this.telefono || !this.email || !this.nombre_mascota ||
         !this.especie || !this.motivo_consulta || !this.fecha_solicitada ||
         !this.hora_solicitada || !this.tipo_cita) {
killedBy: Reservacion CP06 - crear reservacion sin nombre cliente debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Faltan campos requeridos"

Received function did not throw

[Killed] LogicalOperator
src/domain/entities/Reservacion.js:19:9
   }
 
   validar() {
-    if (!this.nombre_cliente || !this.telefono || !this.email || !this.nombre_mascota ||
-        !this.especie || !this.motivo_consulta || !this.fecha_solicitada ||
+    if ((!this.nombre_cliente || !this.telefono || !this.email || !this.nombre_mascota) && !this.especie || !this.motivo_consulta || !this.fecha_solicitada ||
         !this.hora_solicitada || !this.tipo_cita) {
       throw new Error('Faltan campos requeridos para la reservacion');
killedBy: Reservacion CP06 - crear reservacion sin nombre cliente debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Faltan campos requeridos"

Received function did not throw

[Killed] BooleanLiteral
src/domain/entities/Reservacion.js:20:51
 
   validar() {
     if (!this.nombre_cliente || !this.telefono || !this.email || !this.nombre_mascota ||
-        !this.especie || !this.motivo_consulta || !this.fecha_solicitada ||
+        !this.especie || !this.motivo_consulta || this.fecha_solicitada ||
         !this.hora_solicitada || !this.tipo_cita) {
       throw new Error('Faltan campos requeridos para la reservacion');
killedBy: ReservacionService CP21 - crear reservacion debe llamar al repositorio
statusReason: Error: Faltan campos requeridos para la reservacion

[Killed] BooleanLiteral
src/domain/entities/Reservacion.js:20:9
 
   validar() {
     if (!this.nombre_cliente || !this.telefono || !this.email || !this.nombre_mascota ||
-        !this.especie || !this.motivo_consulta || !this.fecha_solicitada ||
+        this.especie || !this.motivo_consulta || !this.fecha_solicitada ||
         !this.hora_solicitada || !this.tipo_cita) {
       throw new Error('Faltan campos requeridos para la reservacion');
killedBy: ReservacionService CP21 - crear reservacion debe llamar al repositorio
statusReason: Error: Faltan campos requeridos para la reservacion

[Killed] BooleanLiteral
src/domain/entities/Reservacion.js:21:9
   validar() {
     if (!this.nombre_cliente || !this.telefono || !this.email || !this.nombre_mascota ||
         !this.especie || !this.motivo_consulta || !this.fecha_solicitada ||
-        !this.hora_solicitada || !this.tipo_cita) {
+        this.hora_solicitada || !this.tipo_cita) {
       throw new Error('Faltan campos requeridos para la reservacion');
     }
killedBy: ReservacionService CP21 - crear reservacion debe llamar al repositorio
statusReason: Error: Faltan campos requeridos para la reservacion

[Killed] BooleanLiteral
src/domain/entities/Reservacion.js:21:34
   validar() {
     if (!this.nombre_cliente || !this.telefono || !this.email || !this.nombre_mascota ||
         !this.especie || !this.motivo_consulta || !this.fecha_solicitada ||
-        !this.hora_solicitada || !this.tipo_cita) {
+        !this.hora_solicitada || this.tipo_cita) {
       throw new Error('Faltan campos requeridos para la reservacion');
     }
killedBy: ReservacionService CP21 - crear reservacion debe llamar al repositorio
statusReason: Error: Faltan campos requeridos para la reservacion

[Killed] BlockStatement
src/domain/entities/Reservacion.js:26:25
     }
   }
 
-  validarEstado(estado) {
-    const estadosValidos = ['pendiente', 'confirmada', 'cancelada', 'reprogramar'];
-    if (!estadosValidos.includes(estado)) {
-      throw new Error('Estado invalido. Debe ser: pendiente, confirmada, cancelada o reprogramar');
-    }
-  }
+  validarEstado(estado) {}
 }
 
killedBy: Reservacion CP08 - estado invalido debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Estado invalido"

Received function did not throw

[Killed] StringLiteral
src/domain/entities/Reservacion.js:27:69
   }
 
   validarEstado(estado) {
-    const estadosValidos = ['pendiente', 'confirmada', 'cancelada', 'reprogramar'];
+    const estadosValidos = ['pendiente', 'confirmada', 'cancelada', ""];
     if (!estadosValidos.includes(estado)) {
       throw new Error('Estado invalido. Debe ser: pendiente, confirmada, cancelada o reprogramar');
killedBy: Reservacion CP - estado valido reprogramar no debe lanzar error
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Estado invalido. Debe ser: pendiente, confirmada, cancelada o reprogramar"

      107 |         } else {
      108 |           stryCov_9fa48("142");
    > 109 |           throw new Error(stryMutAct_9fa48("143") ? "" : (stryCov_9fa48("143"), 'Estado invalido. Debe ser: pendiente, confirmada, cancelada o reprogramar'));

[Killed] StringLiteral
src/domain/entities/Reservacion.js:27:42
   }
 
   validarEstado(estado) {
-    const estadosValidos = ['pendiente', 'confirmada', 'cancelada', 'reprogramar'];
+    const estadosValidos = ['pendiente', "", 'cancelada', 'reprogramar'];
     if (!estadosValidos.includes(estado)) {
       throw new Error('Estado invalido. Debe ser: pendiente, confirmada, cancelada o reprogramar');
killedBy: Reservacion CP09 - estado valido confirmada no debe lanzar error
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Estado invalido. Debe ser: pendiente, confirmada, cancelada o reprogramar"

      107 |         } else {
      108 |           stryCov_9fa48("142");
    > 109 |           throw new Error(stryMutAct_9fa48("143") ? "" : (stryCov_9fa48("143"), 'Estado invalido. Debe ser: pendiente, confirmada, cancelada o reprogramar'));

[Killed] BooleanLiteral
src/domain/entities/Reservacion.js:28:9
 
   validarEstado(estado) {
     const estadosValidos = ['pendiente', 'confirmada', 'cancelada', 'reprogramar'];
-    if (!estadosValidos.includes(estado)) {
+    if (estadosValidos.includes(estado)) {
       throw new Error('Estado invalido. Debe ser: pendiente, confirmada, cancelada o reprogramar');
     }
killedBy: Reservacion CP08 - estado invalido debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Estado invalido"

Received function did not throw

[Killed] ConditionalExpression
src/domain/entities/Reservacion.js:28:9
 
   validarEstado(estado) {
     const estadosValidos = ['pendiente', 'confirmada', 'cancelada', 'reprogramar'];
-    if (!estadosValidos.includes(estado)) {
+    if (false) {
       throw new Error('Estado invalido. Debe ser: pendiente, confirmada, cancelada o reprogramar');
     }
killedBy: Reservacion CP08 - estado invalido debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Estado invalido"

Received function did not throw

[Killed] StringLiteral
src/domain/entities/Reservacion.js:29:23
   validarEstado(estado) {
     const estadosValidos = ['pendiente', 'confirmada', 'cancelada', 'reprogramar'];
     if (!estadosValidos.includes(estado)) {
-      throw new Error('Estado invalido. Debe ser: pendiente, confirmada, cancelada o reprogramar');
+      throw new Error("");
     }
   }
killedBy: Reservacion CP08 - estado invalido debe lanzar error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Estado invalido"
Received message:   ""

      107 |         } else {
      108 |           stryCov_9fa48("142");
    > 109 |           throw new Error(stryMutAct_9fa48("143") ? "" : (stryCov_9fa48("143"), 'Estado invalido. Debe ser: pendiente, confirmada, cancelada o reprogramar'));
